other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_2/simpleFoam-3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

//internalField   uniform 0.00015;
internalField   uniform 0.0096;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "bladenlf26.*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    topAndBottom
    {
        type            zeroGradient;
    }
    
    front
    {
        type            symmetryPlane;
    }
	
    back
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
